Revit 2024 API
ControlledApplication.IsLateAddinLoading Property
 Indicates whether this add-in is loaded on the fly or not. If it is loaded when is Revit starting up, it is false, otherwise it should be true.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsLateAddinLoading { get; }
Visual Basic
Public ReadOnly Property IsLateAddinLoading As Boolean
	Get
Visual C++
public:
property bool IsLateAddinLoading {
	bool get ();
}
See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace